# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

# TODO: your code here

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка

max_str = 0
for fruit in fruits:
    if max_str < len(fruit):
        max_str =len(fruit)

for i, fruit in enumerate(fruits, 1):

    print(str(i)+'.'+' '+' '*(max_str-len(fruit))+fruit)
